views/complaint/_form.php

SELECT * FROM `hgsf_product`
---
            <?= $form->field($model, 'ticket_number')->textInput(['value'=> $model->ticket_number ? $model->ticket_number : $row['gen'], 'readonly'=>true]) ?>
              </div>
              <div class="col-md-6">
     <?= $form->field($model, 'product_id')->dropdownList(
      ArrayHelper::map(Product::find()->all(), 'id', 'product_name'),['value' => 1]) ?>

SELECT * FROM `state`
---
    <div class="row">
      <div class="col-md-4">

        <?= $form->field($model, 'state_id')->widget(Select2::classname(), [
          'data' => ArrayHelper::map(State::find()
          ->all(), 'id', 'state_name'),
          'language' => 'en',
          'options' => ['placeholder' => 'Select State...'],
          'pluginOptions' => [
              'allowClear' => true
          ],
          ]);

SELECT * FROM `hgsf_sub_category`
---

    <div class="row">
      <div class="col-md-6">
        <?= $form->field($model, 'sub_category')->dropdownList(ArrayHelper::map(SubCategory::find()->all(), 'id', 'sub_category'),
        ['prompt' => 'Select Category...']) ?>

SELECT * FROM `hgsf_entry_source`
SELECT * FROM `hgsf_call_source` WHERE `id` IN (1, 2)
---



   <?= $form->field($model, 'entry_source_id')->dropdownList(ArrayHelper::map(EntrySource::find()
   ->all(), 'id', 'source_name'),
   ['prompt' => 'Select Source...']) ?>

   <div id="cs" style="display:none;">
       <?= $form->field($model, 'call_source_id')->dropdownList(ArrayHelper::map(CallSource::find()
        ->where([ 'id'=>[1,2]])
       ->all(), 'id', 'name'),
       ['prompt' => 'Select Call Source...']) ?>